; domain
(define (domain blocksworld)
    (:requirements :strips :typing)
    (:types cube tower robot)

    (:predicates 
     (ontable ?x - cube)
     (on ?x - cube ?y - cube)
     (clear ?x - cube)
     (handempty ?r - robot)
     (holding ?r - robot ?x - cube)
     (ontower ?x - cube ?t - tower)

     (adjacent-left ?x - cube ?y - cube)
     (adjacent-right ?x - cube ?y - cube)
     (adjacent-top ?x - cube ?y - cube)
     (triangle-three ?x - cube ?top - cube ?mid - cube)
     )

    (:action pick-up
     :parameters (?r - robot ?x - cube)
     :precondition (and (ontable ?x) (clear ?x) (handempty ?r))
     :effect (and (holding ?r ?x)
             (not (ontable ?x))
             (not (clear ?x))
             (not (handempty ?r))))
    
     (:action put-down
      :parameters (?r - robot ?x - cube)
      :precondition (holding ?r ?x)
      :effect (and (ontable ?x)
                   (clear ?x)
                   (handempty ?r)
              (not (holding ?r ?x))))

    (:action stack
     :parameters (?r - robot ?x - cube ?y - cube)
     :precondition (and (holding ?r ?x) (clear ?y))
     :effect (and (on ?x ?y)
                  (clear ?x)
                  (handempty ?r)
             (not (holding ?r ?x))
             (not (clear ?y))))
    
     (:action unstack
     :parameters (?r - robot ?x - cube ?y - cube)
     :precondition (and (on ?x ?y) (clear ?x) (handempty ?r))
     :effect (and (ontable ?x)
                  (clear ?y)
             (not (on ?x ?y))
             ))     

    (:action adjacent-left
    :parameters (?r - robot ?x - cube ?y - cube)
    :precondition (and(holding ?r ?x) (ontable ?y))
    :effect (and (adjacent-left ?x ?y)
                 (ontable ?x)
                 (clear ?x)
                 (handempty ?r)
                 (not (holding ?r ?x))))

    (:action adjacent-right
    :parameters (?r - robot ?x - cube ?y - cube)
    :precondition (and(holding ?r ?x)(ontable ?y))
    :effect (and (adjacent-right ?x ?y)
                 (ontable ?x)
                 (clear ?x)
                 (handempty ?r)
                 (not (holding ?r ?x))))

    (:action adjacent-top
    :parameters (?r - robot ?x - cube ?y - cube)
    :precondition (and (holding ?r ?x) (ontable ?y))
    :effect (and (adjacent-top ?x ?y)
                 (ontable ?x)
                 (clear ?x)
                 (handempty ?r)
                 (not (holding ?r ?x))))

    (:action triangle-three
    :parameters (?r - robot ?x - cube ?top -  cube ?mid - cube)
    :precondition (and (handempty ?r)(ontable ?x)
                  (clear ?x)
                  (clear ?top)
                  (clear ?mid)
                  (adjacent-top ?x ?top))
    :effect (and (not (ontable ?x))
            (on ?mid ?x)
            (clear ?x)
            (handempty ?r)
  )
)        
             
)

; problem
(define (problem goal4p1_blocksworld)
    (:domain blocksworld)
    (:objects
    r - robot
    red blue orange - cube
    )

    (:init
    (ontable red)
    (ontable blue)
    (ontable orange)

    (clear red)
    (clear blue)
    (clear orange)


    (handempty r)
  )
    
    (:goal (and
    (on red blue)
    (adjacent-right blue orange)
    (ontable blue)
    (ontable orange)
    (clear red)
    (handempty r)
    

    ))
    )

; plan
1. (pick-up r blue)
   deleted: (ontable blue) (clear blue) (handempty r)
   added: (holding r blue)
   goals met: 2 of 6
2. (adjacent-right r blue orange)
   deleted: (holding r blue)
   added: (adjacent-right blue orange) (ontable blue) (clear blue) (handempty r)
   goals met: 5 of 6
3. (pick-up r red)
   deleted: (ontable red) (clear red) (handempty r)
   added: (holding r red)
   goals met: 3 of 6
4. (stack r red blue)
   deleted: (holding r red) (clear blue)
   added: (on red blue) (clear red) (handempty r)
   goals met: 6 of 6
